src/main/resources/onvif/GetStreamUri.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/media/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:GetStreamUri>
         <wsdl:StreamSetup>
            <sch:Stream>0</sch:Stream>
            <sch:Transport>
               <sch:Protocol>RTSP</sch:Protocol>
               <!--Optional:-->
               <sch:Tunnel/>
            </sch:Transport>
            <!--You may enter ANY elements at this point-->
         </wsdl:StreamSetup>
         <wsdl:ProfileToken>MainProfileToken</wsdl:ProfileToken>
      </wsdl:GetStreamUri>
   </soap:Body>
</soap:Envelope>